# FieldBuilder Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FieldBuilder Class
Members See Also
---
This class is used to create Fields in the Extensible Storage framework.
**Namespace:** Autodesk.Revit.DB.ExtensibleStorage**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public class FieldBuilder : IDisposable
```

Visual Basic
---
```text
Public Class FieldBuilder _
	Implements IDisposable
```

Visual C++
---
```text
public ref class FieldBuilder : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.ExtensibleStorage..::..FieldBuilder
# See Also
FieldBuilder Members
Autodesk.Revit.DB.ExtensibleStorage Namespace